mosagepa/TM4C1294-PWM-Controller/main.c

/*
  main_V24.c - FINAL: Your working PWM + simple UART from uart_echo.c pattern

  Based on your working pwm.c:
  - PWM setup and update logic EXACTLY as in pwm.c (no disable/enable on updates)
  - Simple ISR-based UART echo + line accumulation (like uart_echo.c)
  - DTR session detection on PQ1
  - PSYN command parsing

  NO complex line editor, NO FIFO, NO diagnostics overhead.
  Just clean, working code.

  Build: requires TivaWare DriverLib.
*/

#define _POSIX_C_SOURCE 200809L

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
//#include <ctype.h>

#include <stddef.h>   /* for ptrdiff_t */

/* prototype for newlib/syscalls _sbrk */
extern void * _sbrk(ptrdiff_t incr);


/* Custom functions for command line processing via UART
   and re-implementing typical newlib-style printf's and
   sprintf's via our own lightweight UART output helpers... */
#include "cmdline.h"

// Other libc-related custom helpers and callbacks
#include "ctype_helpers.h"
#include "strtok_compat.h"

// Custom debug helpers to help
// diagnose memory allocations and all that
#include "diag_uart.h"

#include "ui_uart3.h"
#include "commands.h"

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_nvic.h"

#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/pwm.h"
#include "drivers/pinout.h"
#include "utils/uartstdio.h"

#include "utils/ustdlib.h"

#include "timebase.h"
#include "tach.h"
#include "pwmin.h"
#include "bothin.h"
#include "tsyn.h"
#include "tach_default.h"


uint32_t g_ui32SysClock;


/* Configs at MAIN level (avoid declaring UART-comm constants here,
   those will be better place within 'cmdline.h' ... */ 
#define TARGET_PWM_FREQ_HZ 24900U
#define TARGET_DUTY_PERCENT_INIT 30U
#define PSYN_MIN 5
#define PSYN_MAX 96

/* DTR detection pin (PQ1) */
#define DTR_PORT GPIO_PORTQ_BASE
#define DTR_PIN  GPIO_PIN_1

/* PWM globals - as in your working pwm.c */
static uint32_t g_pwmPeriod = 0;
static uint32_t g_pwmPulse  = 0;
static bool g_pwm_enabled = true;
static uint32_t g_pwm_percent_requested = TARGET_DUTY_PERCENT_INIT;

/* UART RX buffer - simple accumulator */
static volatile char user_rx_buf[UART_RX_BUF_SIZE];

static volatile uint32_t user_rx_len = 0;
static volatile bool user_cmd_ready = false;

/* UART3 command history (no malloc; fixed-size ring). */
#define UART3_HIST_MAX 10U
static char g_uart3_hist[UART3_HIST_MAX][UART_RX_BUF_SIZE];
static uint32_t g_uart3_hist_count = 0;
static uint32_t g_uart3_hist_head = 0; /* next write index */
static int32_t g_uart3_hist_nav = -1;  /* -1 = current edit line; 0..count-1 = offset from most recent */
static char g_uart3_hist_scratch[UART_RX_BUF_SIZE];
static uint32_t g_uart3_hist_scratch_len = 0;

static void uart3_hist_add_line(const char *line)
{
    if (!line || *line == '\0') return;

    /* Avoid storing pure whitespace. */
    bool any_nonspace = false;
    for (const char *p = line; *p; ++p) {
        if (*p != ' ' && *p != '\t' && *p != '\r' && *p != '\n') {
            any_nonspace = true;
            break;
        }
    }
    if (!any_nonspace) return;

    /* Avoid duplicate consecutive entries. */
    if (g_uart3_hist_count > 0) {
        uint32_t last_idx = (g_uart3_hist_head + UART3_HIST_MAX - 1U) % UART3_HIST_MAX;
        if (strncmp(g_uart3_hist[last_idx], line, UART_RX_BUF_SIZE) == 0) {
            return;
        }
    }

    strncpy(g_uart3_hist[g_uart3_hist_head], line, UART_RX_BUF_SIZE - 1U);
    g_uart3_hist[g_uart3_hist_head][UART_RX_BUF_SIZE - 1U] = '\0';

    g_uart3_hist_head = (g_uart3_hist_head + 1U) % UART3_HIST_MAX;
    if (g_uart3_hist_count < UART3_HIST_MAX) {
        g_uart3_hist_count++;
    }
}

static const char *uart3_hist_get_recent(uint32_t offset)
{
    if (g_uart3_hist_count == 0) return NULL;
    if (offset >= g_uart3_hist_count) return NULL;

    /* offset=0 => most recent entry */
    uint32_t idx = (g_uart3_hist_head + UART3_HIST_MAX - 1U - offset) % UART3_HIST_MAX;
    return g_uart3_hist[idx];
}

static void uart3_hist_reset_nav(void)
{
    g_uart3_hist_nav = -1;
    g_uart3_hist_scratch_len = 0;
    g_uart3_hist_scratch[0] = '\0';
}

static void uart3_hist_save_scratch_from_current(void)
{
    uint32_t len = user_rx_len;
    if (len >= UART_RX_BUF_SIZE) len = UART_RX_BUF_SIZE - 1U;
    for (uint32_t i = 0; i < len; i++) {
        g_uart3_hist_scratch[i] = (char)user_rx_buf[i];
    }
    g_uart3_hist_scratch[len] = '\0';
    g_uart3_hist_scratch_len = len;
}

static void uart3_line_clear_current(void)
{
    while (user_rx_len > 0) {
        user_rx_len--;
        ROM_UARTCharPutNonBlocking(UART3_BASE, '\b');
        ROM_UARTCharPutNonBlocking(UART3_BASE, ' ');
        ROM_UARTCharPutNonBlocking(UART3_BASE, '\b');
    }
    ((char *)user_rx_buf)[0] = '\0';
}

static void uart3_line_set_from_string(const char *s)
{
    uart3_line_clear_current();
    if (!s) return;

    uint32_t len = 0;
    while (s[len] && len + 1U < UART_RX_BUF_SIZE) {
        char c = s[len];
        ((char *)user_rx_buf)[len] = c;
        ROM_UARTCharPutNonBlocking(UART3_BASE, c);
        len++;
    }
    ((char *)user_rx_buf)[len] = '\0';
    user_rx_len = len;
}

/* Hidden keystroke feature: 5 consecutive 'P' typed on UART3 triggers UART0 GOTCHA. */
static volatile uint8_t g_uart3_p_run = 0;
static volatile bool g_uart3_gotcha_pending = false;
static const char g_uart0_gotcha_msg[] = "\r\nGOTCHA: PPPPP detected on UART3\r\n";

/* Software-requested close of the UART3 session (EXIT command). */
static volatile bool g_uart3_force_disconnect = false;
/* When a software EXIT closes the session, require a DTR release (idle/high)
    before allowing a new session to begin. This prevents immediate auto-reopen
    when the host keeps DTR asserted. */
static volatile bool g_uart3_require_dtr_release = false;
static volatile bool g_uart3_sw_disconnect_requested = false;

static void flash_pf4_gotcha(uint32_t flashes)
{
    /* PF4 is already configured as GPIO output in setup_uarts(). */
    const uint32_t delay_ticks = g_ui32SysClock / 40U; /* ~75ms at 120MHz (SysCtlDelay loop is ~3 cycles) */
    for (uint32_t i = 0; i < flashes; i++) {
        ROM_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, GPIO_PIN_4);
        SysCtlDelay(delay_ticks);
        ROM_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, 0);
        SysCtlDelay(delay_ticks);
    }
}

/* UART0 diagnostics gating (default OFF). */
static volatile bool g_debug_enabled = false;

void debug_set_enabled(bool enabled)
{
    g_debug_enabled = enabled;
}

bool debug_is_enabled(void)
{
    return g_debug_enabled;
}

void uart3_request_disconnect(void)
{
    g_uart3_force_disconnect = true;
    g_uart3_sw_disconnect_requested = true;
}

