mosagepa/TM4C1294-PWM-Controller/main.c
/* Forward declarations */
static void setup_system_clock(void);
static void setup_pwm_pf2(void);
static void set_pwm_percent(uint32_t percent);
static void setup_uarts(void);
static void process_user_line(const char *line) __attribute__((unused));
static void user_uart3_consume_pending_input(void);

/* Expose PWM setter to higher-level command module without changing ISR logic. */
void pwm_set_percent(uint32_t percent)
{
    g_pwm_percent_requested = percent;
    set_pwm_percent(percent);
}

uint32_t pwm_get_percent_requested(void)
{
    return g_pwm_percent_requested;
}

void pwm_set_enabled(bool enabled)
{
    if (enabled) {
        /* Restore PF2 to PWM function and enable output. */
        GPIOPinConfigure(GPIO_PF2_M0PWM2);
        GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_2);
        PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, g_pwmPulse);
        PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, true);
        g_pwm_enabled = true;
        return;
    }

    /* Disable PWM output and force PF2 low for clean scope viewing. */
    PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, false);
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_2);
    GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);
    g_pwm_enabled = false;
}

bool pwm_is_enabled(void)
{
    return g_pwm_enabled;
}


/* ICDI UART0 ISR - echo only */
void ICDIUARTIntHandler(void)
{
    uint32_t ui32Status = ROM_UARTIntStatus(UART0_BASE, true);

    ROM_UARTIntClear(UART0_BASE, ui32Status);

    while (ROM_UARTCharsAvail(UART0_BASE)) {

        ROM_UARTCharPutNonBlocking(UART0_BASE, ROM_UARTCharGetNonBlocking(UART0_BASE));
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_PIN_0);
        SysCtlDelay(g_ui32SysClock / (1000 * 3));
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0);

    }

}


/* USER UART3 ISR - echo + accumulate, exactly as in your pwm.c */
void USERUARTIntHandler(void)
{
    uint32_t ui32Status = ROM_UARTIntStatus(UART3_BASE, true);

    ROM_UARTIntClear(UART3_BASE, ui32Status);

    while (ROM_UARTCharsAvail(UART3_BASE)) {

        /* Minimal ANSI escape parsing for arrow keys: ESC [ A/B */
        static uint8_t esc_state = 0; /* 0=normal, 1=got ESC, 2=got ESC[, 3=got ESC O */

        uint8_t c = ROM_UARTCharGetNonBlocking(UART3_BASE);

        if (user_cmd_ready) {
            /* Ignore extra RX bytes until main loop consumes the line. */
            continue;
        }

        if (esc_state != 0) {
            if (esc_state == 1) {
                if (c == '[') {
                    esc_state = 2;
                } else if (c == 'O') {
                    esc_state = 3;
                } else {
                    esc_state = 0;
                }
                continue;
            }
            if (esc_state == 2 || esc_state == 3) {
                /* Arrow up/down (CSI: ESC [ A/B) or SS3: ESC O A/B). */
                if (c == 'A') {
                    if (g_uart3_hist_count > 0) {
                        if (g_uart3_hist_nav < 0) {
                            uart3_hist_save_scratch_from_current();
                            g_uart3_hist_nav = 0;
                        } else if ((uint32_t)g_uart3_hist_nav + 1U < g_uart3_hist_count) {
                            g_uart3_hist_nav++;
                        }

                        const char *cmd = uart3_hist_get_recent((uint32_t)g_uart3_hist_nav);
                        uart3_line_set_from_string(cmd);
                    }
                } else if (c == 'B') {
                    if (g_uart3_hist_nav >= 0) {
                        if (g_uart3_hist_nav == 0) {
                            g_uart3_hist_nav = -1;
                            uart3_line_set_from_string(g_uart3_hist_scratch);
                        } else {
                            g_uart3_hist_nav--;
                            const char *cmd = uart3_hist_get_recent((uint32_t)g_uart3_hist_nav);
                            uart3_line_set_from_string(cmd);
                        }
                    }
                }

                esc_state = 0;
                continue;
            }

            esc_state = 0;
            continue;
        }

        if (c == 0x1B) {
            esc_state = 1;
            continue;
        }

        /* Handle backspace/delete locally (do not allow erasing prompt). */
        if (c == '\b' || c == 0x7FU) {
            g_uart3_p_run = 0;
            uart3_hist_reset_nav();
            if (user_rx_len > 0) {
                user_rx_len--;
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\b');
                ROM_UARTCharPutNonBlocking(UART3_BASE, ' ');
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\b');
            } else {
                /* Bell if user tries to backspace past prompt. */
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\a');
            }
            continue;
        }

        /* Enter handling */
        if ((char)c == '\r' || (char)c == '\n') {
            g_uart3_p_run = 0;
            if (user_rx_len > 0) {
                /* Echo newline once, finalize command. */
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\r');
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\n');
                user_rx_buf[user_rx_len] = '\0';
                user_cmd_ready = true;
            } else {
                /* Empty line: do NOTHING (no extra newline, no extra prompt). */
            }
            continue;
        }

        /* Uppercase-as-you-type for printable letters (ESP32-style). */
        if (c >= 'a' && c <= 'z') {
            c = (uint8_t)(c - 'a' + 'A');
        }

        /* Any normal character input resets history navigation. */
        uart3_hist_reset_nav();

        /* Hidden GOTCHA: trigger immediately on 5 consecutive 'P' keystrokes. */
        if (c == 'P') {
            if (g_uart3_p_run < 5) {
                g_uart3_p_run++;
            }
            if (g_uart3_p_run == 5) {
                g_uart3_gotcha_pending = true;
                /* Restart counting so long runs only trigger every 5. */
                g_uart3_p_run = 0;
            }
        } else {
            g_uart3_p_run = 0;
        }

        /* Echo normal characters immediately */
        ROM_UARTCharPutNonBlocking(UART3_BASE, c);

        /* Toggle PF4 LED on each received byte */
        static uint8_t led = 0;
        led = !led;
        ROM_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, led ? GPIO_PIN_4 : 0);

        if (user_rx_len + 1 < UART_RX_BUF_SIZE) {
            user_rx_buf[user_rx_len++] = (char)c;
        } else {
            /* Overflow - reset */
            user_rx_len = 0;
            g_uart3_p_run = 0;
            const char *err = "\r\nERROR: line too long\r\n> ";
            while (*err) ROM_UARTCharPutNonBlocking(UART3_BASE, *err++);
        }
    }

