mosagepa/TM4C1294-PWM-Controller/main.c
}


/* Command processing - exactly as in your pwm.c */
static __attribute__((unused)) void process_user_line(const char *line)
{
    /* Skip leading spaces */
    while (*line && my_isspace((unsigned char)*line)) line++;

    char buf[UART_RX_BUF_SIZE];
    strncpy(buf, line, sizeof(buf) - 1);
    buf[sizeof(buf) - 1] = '\0';

    char *saveptr = NULL;
    char *tok = strtok_r(buf, " \t", &saveptr);
    if (!tok) {
        UARTSend((const uint8_t *)"\r\n> ", 4, UARTDEV_USER);
        return;
    }

    /* Case-insensitive PSYN */
    for (char *p = tok; *p; ++p) *p = (char)my_toupper((unsigned char)*p);

    if (strcmp(tok, "PSYN") == 0) {
        char *numtok = strtok_r(NULL, " \t", &saveptr);
        if (!numtok) {
            UARTSend((const uint8_t *)"\r\nERROR: missing value. Use: PSYN n  (n=5..96)\r\n> ", 51, UARTDEV_USER);
            return;
        }

        char *endptr;
        long val = strtol(numtok, &endptr, 10);
        if (*endptr != '\0') {
            UARTSend((const uint8_t *)"\r\nERROR: invalid number. Use: PSYN n\r\n> ", 41, UARTDEV_USER);
            return;
        }
        if (val < PSYN_MIN || val > PSYN_MAX) {
            UARTSend((const uint8_t *)"\r\nERROR: value out of range (5..96)\r\n> ", 41, UARTDEV_USER);
            return;
        }

        /* Valid - update PWM using YOUR working function */
        set_pwm_percent((uint32_t)val);

          /* Always re-print prompt after a successful command.
              (Errors already include their own trailing "> ".) */
          UARTSend((const uint8_t *)"\r\n> ", 4, UARTDEV_USER);

        //static char ack[26];   // DUDA PORQUE AQUI HACE SNPRINTF !!!! --- DEBO "NEWLIBEAR" !!

        //int n = snprintf(ack, 25, "\r\nOK: duty set to %ld%%\r\n> ", val);

        //UARTSend((const uint8_t *)ack, (uint32_t)n, UARTDEV_USER);

    } else {

        UARTSend((const uint8_t *)"\r\nERROR: unknown command. Use: PSYN n\r\n> ", 43, UARTDEV_USER);
    }

}


/*
   When terminals send CRLF, the ISR will typically mark the command ready
   on '\r' and later echo '\n'. If we print the prompt while UART3 interrupts
   are disabled (as we do during command processing), that delayed '\n' can
   arrive after the prompt and move the cursor to a new line with no prompt,
   creating the "needs an extra ENTER" symptom.

   To avoid touching the UART3 ISR, we opportunistically consume any pending
   RX bytes here (while IRQ is disabled). We swallow lone EOL tails and, if
   any real characters are already queued (user typed quickly), we handle
   them with the same accumulate/echo logic so they are not lost.
*/
static void user_uart3_consume_pending_input(void)
{
    while (ROM_UARTCharsAvail(UART3_BASE)) {
        int32_t rc = ROM_UARTCharGetNonBlocking(UART3_BASE);
        if (rc < 0) {
            break;
        }

        char c = (char)rc;

        /* Swallow extra CR/LF tails after a completed command line. */
        if (c == '\n' || c == '\r') {
            continue;
        }

        /* Re-echo (ISR would have echoed) */
        ROM_UARTCharPutNonBlocking(UART3_BASE, (uint8_t)c);

        if (user_cmd_ready) {
            continue;
        }

        if (user_rx_len + 1 < UART_RX_BUF_SIZE) {
            user_rx_buf[user_rx_len++] = c;
        } else {
            user_rx_len = 0;
            const char *err = "\r\nERROR: line too long\r\n> ";
            while (*err) ROM_UARTCharPutNonBlocking(UART3_BASE, *err++);
        }
    }
}


/* PWM update - EXACTLY as in your working pwm.c (NO disable/enable!) */
static void set_pwm_percent(uint32_t percent)
{
    if (percent > 100) percent = 100;
    uint32_t pulse = (uint32_t)(((uint64_t)g_pwmPeriod * percent) / 100U);
    if (pulse >= g_pwmPeriod) pulse = g_pwmPeriod - 1;
    if (pulse == 0) pulse = 1;

    /* ONLY set pulse width - no disable/enable */
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, pulse);
    g_pwmPulse = pulse;
}


/* PWM setup - EXACTLY as in your working pwm.c */
static void setup_pwm_pf2(void)
{
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    while (!SysCtlPeripheralReady(SYSCTL_PERIPH_PWM0)) { }
    while (!SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOF)) { }

    GPIOPinConfigure(GPIO_PF2_M0PWM2);
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_2);

    PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_1);

    uint32_t pwmClock = g_ui32SysClock;
    uint32_t period = (pwmClock + (TARGET_PWM_FREQ_HZ / 2U)) / TARGET_PWM_FREQ_HZ;
    if (period == 0) period = 1;
    if (period > 0xFFFF) period = 0xFFFF;

    g_pwmPeriod = period;

    uint32_t init_pulse = (uint32_t)(((uint64_t)period * TARGET_DUTY_PERCENT_INIT) / 100U);
    if (init_pulse >= period) init_pulse = period - 1;
    if (init_pulse == 0) init_pulse = 1;
    g_pwmPulse = init_pulse;
    g_pwm_percent_requested = TARGET_DUTY_PERCENT_INIT;

    PWMGenConfigure(PWM0_BASE, PWM_GEN_1, PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_1, period);
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, init_pulse);
    PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, true);
    PWMGenEnable(PWM0_BASE, PWM_GEN_1);

    g_pwm_enabled = true;
}


static void setup_system_clock(void)
{
    g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN |
                                             SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_480), 120000000);
}


static void setup_uarts(void)
{
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART3);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOQ);
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    GPIOPinConfigure(GPIO_PA0_U0RX);
    GPIOPinConfigure(GPIO_PA1_U0TX);
    MAP_GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    GPIOPinConfigure(GPIO_PJ0_U3RX);
    GPIOPinConfigure(GPIO_PJ1_U3TX);
    MAP_GPIOPinTypeUART(GPIO_PORTJ_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    /* PF4 LED for RX activity */
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_4);
    ROM_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, 0);

    /* PQ1 DTR detection */
    GPIOPadConfigSet(GPIO_PORTQ_BASE, GPIO_PIN_1, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
    ROM_GPIOPinTypeGPIOInput(GPIO_PORTQ_BASE, GPIO_PIN_1);

    ROM_UARTConfigSetExpClk(UART0_BASE, g_ui32SysClock, 9600,
                            (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));
    ROM_UARTConfigSetExpClk(UART3_BASE, g_ui32SysClock, 115200,
                            (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));

    MAP_IntMasterEnable();
    ROM_IntEnable(INT_UART0);
    ROM_UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
    ROM_IntEnable(INT_UART3);
    ROM_UARTIntEnable(UART3_BASE, UART_INT_RX | UART_INT_RT);
}


// ==== AUXILIARY STRUCTURES AND FUNCTIONS FOR UART0 (ICDI) DEBUG

//static char hexShowBuf[13] = "CHAR: 0x--\r\n\0";


// Tiny sprintf that ONLY handles "%02X" format
/*
static int tiny_sprintf_hex(char *buf, const char *fmt, uint8_t value)
{
    const char hex[] = "0123456789ABCDEF";

    // Simple pattern match for "%02X"
    if (fmt[0] == '%' && fmt[1] == '0' && fmt[2] == '2' && fmt[3] == 'X') {
        buf[0] = hex[(value >> 4) & 0x0F];
        buf[1] = hex[value & 0x0F];
        buf[2] = '\0';
        return 2;
    }
    return 0;
}
*/


void example_dynamic_cmd_copy_and_process(const volatile char *user_rx_buf, uint32_t len)
{
    if (!debug_is_enabled()) {
        return;
    }

    char cmd_local[UART_RX_BUF_SIZE];
    if (len >= UART_RX_BUF_SIZE) len = UART_RX_BUF_SIZE - 1;
    for (uint32_t i = 0; i < len; i++) {
        cmd_local[i] = (char)user_rx_buf[i];
    }
    cmd_local[len] = '\0';

    diag_puts("DEBUG: cmd = '");
    diag_puts(cmd_local);
    diag_puts("'\r\n");

    /* Print the length for diagnostics (ICDI UART) */
    diag_puts("DEBUG: cmd len = ");
    diag_put_hex32(len);
    diag_puts("\r\n");

