mosagepa/TM4C1294-PWM-Controller/main.c
    /* spew out some diagnostic summaries... */
    diag_print_variable("g_pwmPeriod", (const void *)&g_pwmPeriod, sizeof(g_pwmPeriod), DIAG_PREVIEW_LIMIT);
    diag_print_variable("g_pwmPulse", (const void *)&g_pwmPulse, sizeof(g_pwmPulse), DIAG_PREVIEW_LIMIT);

    /* Temporary: Test specific parts to find the exact problem */
    diag_puts("DEBUG: After PWM variables, testing malloc...\r\n");
    
    /* Test 1: strlen */
    const char *lit = "DYN_TEST: Hello from dynamic buffer!";
    size_t lit_len = strlen(lit);
    diag_puts("DEBUG: strlen completed, lit_len=");
    diag_put_u32_dec((uint32_t)lit_len);
    diag_puts("\r\n");
    
    /* Test 2: malloc */
    char* dyn = (char *)malloc(lit_len + 1);
    if (!dyn) {
        diag_puts("ERROR: malloc failed\r\n");
    } else {
        diag_puts("DEBUG: malloc succeeded, ptr=");
        diag_put_ptr((void *)dyn);
        diag_puts("\r\n");
        
        /* Test 3: memcpy */
        memcpy(dyn, lit, lit_len + 1);
        diag_puts("DEBUG: memcpy completed\r\n");
        
        /* Test 4: diag_print_variable with NOLIMIT (WORKS!) */
        diag_puts("DEBUG: About to call diag_print_variable with NOLIMIT...\r\n");
        diag_print_variable("dyn_str", (const void *)dyn, (size_t)(lit_len + 1), DIAG_PREVIEW_NOLIMIT);
        diag_puts("DEBUG: diag_print_variable completed\r\n");
        
        /* Memory integrity check before stack-heavy operations */
        diag_check_memory_integrity("pre-sprintf-test");
        
        /* Test 5: Stack usage test - declare msgbuf array (WORKS!) */
        diag_puts("DEBUG: About to declare msgbuf[320]...\r\n");
        diag_check_stack_usage("before-msgbuf-declaration");
        char msgbuf[320];
        diag_check_stack_usage("after-msgbuf-declaration");
        diag_puts("DEBUG: msgbuf declared, testing our sprintf replacement...\r\n");
        
        /* Test 6: Use our custom sprintf replacement */
        int n = sprintf(msgbuf, "SPRINTF: dyn@%p len=%u contents='%s'\r\n",
            (void *)dyn, (unsigned)lit_len, dyn);
        if (n > 0) {
            diag_puts("DEBUG: sprintf replacement succeeded, n=");
            diag_put_u32_dec((uint32_t)n);
            diag_puts("\r\n");
            // Send the formatted string to ICDI (UART0) using UARTSend
            UARTSend((const uint8_t *)msgbuf, (uint32_t)n, UARTDEV_ICDI);
            diag_puts("DEBUG: UARTSend completed\r\n");
        } else {
            diag_puts("ERROR: sprintf replacement failed\r\n");
        }
        
        /* Free immediately */
        free(dyn);
        diag_puts("DEBUG: free completed\r\n");
    }

    /*
     * Commented out dynamic allocation test to isolate stall issue
     * --- Dynamic string allocation test (inserted test) ---
    const char *lit = "DYN_TEST: Hello from dynamic buffer!";
    size_t lit_len = strlen(lit);

     * allocate exact space (len + NUL)
    char* dyn = NULL;
    
    //dyn = (char *)malloc(lit_len + 1);

    //if (!dyn) {
    if (false) {  // FORCE THE ERROR PATH FOR TESTING

        diag_puts("ERROR: malloc for dyn string FAILED\r\n");

    } else {
        
        * copy literal into allocated area (this makes the bytes come from heap memory)
        memcpy(dyn, lit, lit_len + 1);

        * Print address and length using diag helpers (ICDI UART)
        diag_puts("DYN ALLOC -> addr=");
        diag_put_ptr((void *)dyn);
        diag_puts(" len=");
        diag_put_u32_dec((uint32_t)lit_len);
        diag_puts("\r\n");

        * Use diag_print_variable to print region and a hex-preview of the allocated block
        diag_print_variable("dyn_str", (const void *)dyn, (size_t)(lit_len + 1), DIAG_PREVIEW_NOLIMIT);

        * Demonstrate snprintf usage: format a human line and send it via ICDI UART
        //char msgbuf[320];  ---> TRY TO USE THIS "THE PROPER WAY" LATER ON !!!

        void *sp = NULL;
        __asm__ volatile ("mov %0, sp" : "=r" (sp));

        diag_puts("SP before snprintf = ");
        diag_put_ptr(sp); diag_puts("\r\n");
        diag_puts("sbrk(0) before = ");
        diag_put_ptr(_sbrk(0)); diag_puts("\r\n");

        *
        int n = snprintf(msgbuf, sizeof(msgbuf),
            "SNPRINTF: dyn@%p len=%u contents='%s'\r\n",
            (void *)dyn, (unsigned)lit_len, dyn);
        if (n > 0) {
            // Send the formatted string to ICDI (UART0) using your project wrapper
                UARTSend((const uint8_t *)msgbuf, (uint32_t)(n > (int)sizeof(msgbuf) ? sizeof(msgbuf) : n), UARTDEV_ICDI);
        }
        

        * --- replace the old stack snprintf block with this: ---
        *
        {
            int n = diag_snprintf_heap_send("SNPRINTF: dyn@%p len=%u contents='%s'\r\n",
                                    (void *)dyn, (unsigned)lit_len, dyn);
            if (n < 0) {
                diag_puts("ERROR: diag_snprintf_heap_send failed\r\n");
            }
        }
        

        * Free the block and show a short note
        free(dyn);
        diag_puts("DYN ALLOC freed\r\n");

    }        -- end dynamic test --
    */

    void *cur_brk = _sbrk(0);
    diag_print_variable("sbrk(0)", cur_brk, 16, DIAG_PREVIEW_LIMIT); /* preview 16 bytes at current brk */

    diag_print_variables_summary();

}


int main(void)
{
    setup_system_clock();

    // Check if we had a hard fault (bit 31 of SCB->HFSR)
    if (HWREG(0xE000ED2C) & 0x80000000) {
        // Hard fault occurred! Likely stack overflow
        while(1) {
            // Blink PN0 rapidly as a warning
            ROM_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_PIN_0);
            SysCtlDelay(g_ui32SysClock / 100);
            ROM_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0);
            SysCtlDelay(g_ui32SysClock / 100);
        }
    }

    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_0);

    setup_pwm_pf2();
    setup_uarts();

    /* Non-blocking timebase + tach input (does not touch PWM mechanics). */
    timebase_init(g_ui32SysClock);
    tach_init();
    pwmin_init(g_ui32SysClock);
    tsyn_init(g_ui32SysClock);

    /* Load/apply persistent default behavior (fallback is PHASE1L). */
    tach_default_init();
    tach_default_apply();

