mosagepa/TM4C1294-PWM-Controller/main.c
    /* Initial basic probing of the _sbrk allocation callback/ helper */
    //diag_sbrk_probe();

    /* Immediately print the memory layout with direct UART writes */
    //diag_print_memory_layout();

    /* Optionally run the malloc stress test */
    //diag_test_malloc_sequence();

    /* Alternatively (if malloc_sequence stalls) use GPIO toggling
       in order to debug whether malloc() internally calls _sbrk
       adequately (we choose the LED on PN0 for this Launchpad)    */
    //diag_test_malloc_with_gpio();

    /* Print again the (updated) memory layout with direct UART writes */
    //diag_print_memory_layout();


    for (;;) {

        /* If the user closed the session via EXIT, do not immediately restart
           while the host still asserts DTR. Require DTR to return to idle/high
           (e.g., close/reopen terminal) before accepting a new session. */
        if (g_uart3_require_dtr_release) {
            UARTSend((const uint8_t *)"WAITING FOR DTR RELEASE\r\n", 25, UARTDEV_ICDI);
            while (!ROM_GPIOPinRead(DTR_PORT, DTR_PIN)) {
                SysCtlDelay(g_ui32SysClock / (1000 * 100));
            }

            /* Re-enable UART3 RX now that the host released DTR. */
            ROM_IntEnable(INT_UART3);
            ROM_UARTIntEnable(UART3_BASE, UART_INT_RX | UART_INT_RT);

            g_uart3_require_dtr_release = false;
        }

        /* Wait for DTR session */
        UARTSend((const uint8_t *)"NO SESSION ACTIVE\r\n", 20, UARTDEV_ICDI);

        while (ROM_GPIOPinRead(DTR_PORT, DTR_PIN)) {
            /* Keep BOOT profile running even without an active UART3 session. */
            tachsyn_boot_task();
            SysCtlDelay(g_ui32SysClock / (1000 * 100));
        }

        UARTSend((const uint8_t *)"SESSION WAS INITIATED\r\n", 24, UARTDEV_ICDI);
        SysCtlDelay(g_ui32SysClock / (1000 * 12));

        /* UART3 welcome/prompt (pure output; does not touch ISR mechanics) */
        ui_uart3_session_begin();

        g_uart3_force_disconnect = false;

        user_rx_len = 0;
        user_cmd_ready = false;

        /* Session active */
        /* Debounce DTR release so brief glitches don't drop the session. */
        uint32_t dtr_high_streak = 0;
        enum { DTR_DISCONNECT_STREAK = 8 }; /* ~8 * (loop sleep ~10ms) ~= ~80ms */

        while (!g_uart3_force_disconnect) {

            if (ROM_GPIOPinRead(DTR_PORT, DTR_PIN)) {
                if (dtr_high_streak < DTR_DISCONNECT_STREAK) {
                    dtr_high_streak++;
                }
                if (dtr_high_streak >= DTR_DISCONNECT_STREAK) {
                    break;
                }
            } else {
                dtr_high_streak = 0;
            }

            /* Periodic tach reporting to UART0 if enabled (TACHIN command). */
            tach_task();

            /* Advance TSYN BOOT profile if enabled (updates PM3 TACHSYN). */
            tachsyn_boot_task();

            /* Periodic PWM-input reporting to UART0 if enabled (PWMIN command). */
            pwmin_task();

            /* Periodic combined reporting to UART0 if enabled (BOTHIN command). */
            bothin_task();

            if (g_uart3_gotcha_pending) {
                g_uart3_gotcha_pending = false;
                UARTSend((const uint8_t *)g_uart0_gotcha_msg, (uint32_t)(sizeof(g_uart0_gotcha_msg) - 1U), UARTDEV_ICDI);
                flash_pf4_gotcha(5U);
            }

            if (user_cmd_ready) {

                ROM_IntDisable(INT_UART3);

                // It seems this causes problems/ stalls IF it is
                // declared after any previous invocations of
                // the 'diag_test_malloc_with_gpio()' helper debug function !!!

                // So, before THAT happens, let's launch this dynamic vector
                // or buffer allocation, made by explicit calls to our helpers:

                uint32_t len = user_rx_len;
                if (len >= UART_RX_BUF_SIZE) len = UART_RX_BUF_SIZE - 1;

                char cmd_local[UART_RX_BUF_SIZE];
                for (uint32_t i = 0; i < len; i++) {
                    cmd_local[i] = (char)user_rx_buf[i];
                }
                cmd_local[len] = '\0';

                user_rx_len = 0;
                user_cmd_ready = false;

                /* Consume any pending CR/LF tail (and preserve real chars if any). */
                user_uart3_consume_pending_input();

                ROM_IntEnable(INT_UART3);

                if (cmd_local[0] != '\0') {
                    uart3_hist_add_line(cmd_local);
                    commands_process_line(cmd_local);
                }

                /* Optional UART0 diagnostics (default OFF). */
                if (debug_is_enabled()) {
                    example_dynamic_cmd_copy_and_process(user_rx_buf, len);
                    diag_print_memory_layout();
                }

            }

                /* Do not sleep indefinitely waiting for UART interrupts.
                    DTR is polled (no GPIO interrupt), so we must wake periodically
                    to notice disconnect immediately without requiring an ENTER on UART0. */
                SysCtlDelay(g_ui32SysClock / 300);

        }

        /* If the loop ended because of software EXIT, latch closed-until-release.
           Also silence UART3 RX so the terminal appears disconnected (user must
           close/reopen or toggle DTR to start a new session). */
        if (g_uart3_force_disconnect && g_uart3_sw_disconnect_requested) {
            g_uart3_require_dtr_release = true;
            ROM_UARTIntDisable(UART3_BASE, UART_INT_RX | UART_INT_RT);
            ROM_IntDisable(INT_UART3);
        }

        g_uart3_force_disconnect = false;
        g_uart3_sw_disconnect_requested = false;

        UARTSend((const uint8_t *)"SESSION WAS DISCONNECTED\r\n", 27, UARTDEV_ICDI);

    }

    return 0;
}

